app/controllers/dashboard_controller.rb

SELECT "expense_reports".* FROM "expense_reports" WHERE ("expense_reports".user_id = 1) LIMIT 5
---
  def index
    @receipt = Receipt.new(:purchase_date => Time.now.to_date)
    @receipts = current_user.receipts.find(:all, :limit => 5)
    @stats = {:total => current_user.receipts.sum(:total).to_f,
              :unexpensed_total => unexpensed_receipts.sum(:total).to_f,
              :expensed_total => current_user.receipts.sum(:total, :conditions => ["expensed = ?", true]).to_f,
              :unexpensed_receipts_count => unexpensed_receipts.count.to_i}
    @reports = current_user.expense_reports.find(:all, :limit => 5, :order => 'created_at DESC')