app/controllers/dashboard_controller.rb

SELECT "receipts".* FROM "receipts" WHERE ("receipts".user_id = 1) ORDER BY purchase_date DESC LIMIT 5
SELECT SUM("receipts"."total") AS sum_id FROM "receipts" WHERE ("receipts".user_id = 1) AND ("receipts"."expensable" = 't') AND ("receipts"."expensed" = 'f')
---
  def index
    @receipt = Receipt.new
    @receipts = current_user.receipts.find(:all, :limit => 5)
    @stats = {:total => current_user.receipts.sum('total'),
              :unexpensed_total => current_user.receipts.sum('total', :conditions => ["expensable = ?", true])}