app/controllers/expense_report_controller.rb

SELECT "expense_reports".* FROM "expense_reports" WHERE ("expense_reports".user_id = 1) AND ("expense_reports"."id" = 0) LIMIT 1
---
  def show
    @report = current_user.expense_reports.find(params[:id])

SELECT "receipts".* FROM "receipts" WHERE ("receipts".user_id = 1) AND ("receipts"."id" = 6) ORDER BY purchase_date DESC LIMIT 1
UPDATE "receipts" SET "expense_report_id" = 5, "expensed" = 't', "updated_at" = '2010-11-17 04:45:55.544569' WHERE ("receipts"."id" = 4)
INSERT INTO "expense_reports" ("created_at", "external_report_id", "updated_at", "user_id") VALUES ('2010-11-16 09:09:00.241854', NULL, '2010-11-16 09:09:00.241854', 1)
---
  def create
    @report = ExpenseReport.new(:external_report_id => params[:external_report_id],
                                :user => current_user)
    unless params[:receipt_ids].nil?
      params[:receipt_ids].each do |receipt_id|
        receipt = current_user.receipts.find(receipt_id)
        receipt.expensed = true
        receipt.expense_report = @report
        receipt.save
      end
    end

    if @report.save