app/controllers/receipts_controller.rb

  def index
    @receipt = Receipt.new
    @receipts = Receipt.find(:all, :limit => 5)
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts".user_id = 1) ORDER BY created_at DESC LIMIT 5