app/controllers/receipts_controller.rb

  def index
    @receipt = Receipt.new(:purchase_date => Time.now.to_date)
    @receipts = current_user.receipts.find(:all)
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts".user_id = 1) ORDER BY purchase_date DESC

  def show
    @receipt = current_user.receipts.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts".user_id = 1) AND ("receipts"."id" = 65) ORDER BY purchase_date DESC LIMIT 1

  def edit
    @receipt = current_user.receipts.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts".user_id = 1) AND ("receipts"."id" = 4) ORDER BY purchase_date DESC LIMIT 1

  def create
    participants = []
    unless params[:participant_names].nil?
      params[:participant_names].split(",").each do |name|
        name = name.strip
        guy = Participant.find_or_create_by_name(name)
        guy.update_attributes(:user => current_user)
        participants << guy
      end
    end
    @receipt = Receipt.new(
      :purchase_date => params[:receipt][:purchase_date],
      :total => params[:receipt][:total],
      :store_id => Store.find_or_create_by_name(params[:receipt][:store_name]).id,
      :expensable => params[:receipt][:expensable],
      :expensed => params[:receipt][:expensed],
      :note => params[:receipt][:note],
      :user => current_user,
      :participants => participants)
---
INSERT INTO "participants" ("name", "created_at", "updated_at", "user_id") VALUES ('tim johnson', '2010-11-24 23:12:59.066844', '2010-11-24 23:12:59.066844', 1)
SELECT "participants"."id" FROM "participants" WHERE (LOWER("participants"."name") = LOWER('tim johnson')) LIMIT 1
INSERT INTO "receipts" ("store_id", "purchase_date", "total", "created_at", "updated_at", "expensable", "user_id", "expensed", "expense_report_id", "receipt_image") VALUES (6, '2010-11-17', 98.0, '2010-11-18 06:12:28.740124', '2010-11-18 06:12:28.740124', 'f', 1, 'f', NULL, NULL)
INSERT INTO "stores" ("created_at", "name", "updated_at") VALUES ('2010-10-28 06:46:21.887627', 'nonexistent sTOre', '2010-10-28 06:46:21.887627')
SELECT "stores"."id" FROM "stores" WHERE (LOWER("stores"."name") = LOWER('nonexistent sTOre')) LIMIT 1
SELECT SUM("receipts"."total") AS sum_id FROM "receipts" WHERE ("receipts".user_id = 1) AND ("receipts"."expensable" = 't') AND ("receipts"."expensed" = 'f')

  def update
    @receipt = current_user.receipts.find(params[:id])
     participants = []
      unless params[:old_participants].nil?
        params[:old_participants].each do |guest|
          guy = Participant.find_by_name(guest)
          participants << guy
        end
      end
      unless params[:participant_names].nil?
        params[:participant_names].split(",").each do |name|
          name = name.strip
          guy = Participant.find_or_create_by_name(name)
          guy.update_attributes(:user => current_user)
          participants << guy
        end
      end

    respond_to do |format|
      if @receipt.update_attributes(:purchase_date => params[:receipt][:purchase_date],
          :total => params[:receipt][:total],
          :store_id => Store.find_or_create_by_name(params[:receipt][:store_name]).id,
          :expensable => params[:receipt][:expensable],
          :expensed => params[:receipt][:expensed],
          :note => params[:receipt][:note],
          :user => current_user,
          :participants => participants)
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts".user_id = 1) AND ("receipts"."id" = 4) ORDER BY purchase_date DESC LIMIT 1
SELECT "stores".* FROM "stores" WHERE (LOWER(name) = 'test') LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "receipts" SET "created_at" = '2010-11-05 08:01:00.521013', "purchase_date" = '2010-11-05 08:01:00.000000', "updated_at" = '2010-11-05 08:01:00.521013' WHERE ("receipts"."id" = 1)

  def destroy
    @receipt = current_user.receipts.find(params[:id])
    @receipt.destroy
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts"."id" = 1) ORDER BY created_at, desc LIMIT 1
DELETE FROM "receipts" WHERE ("receipts"."id" = 980190962)