app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores"
---
  def index
    @stores = Store.all

SELECT "stores".* FROM "stores" WHERE ("stores"."id" = 0) LIMIT 1
---
  def show
    @store = Store.find(params[:id])

SELECT "stores".* FROM "stores" WHERE ("stores"."id" = 26) LIMIT 1
---
  def edit
    @store = Store.find(params[:id])

INSERT INTO "stores" ("created_at", "name", "updated_at") VALUES ('2010-10-28 05:33:07.503074', 'The Limited', '2010-10-28 05:33:07.503074')
---
  def create
    @store = Store.new(params[:store])

    respond_to do |format|
      if @store.save

SELECT "stores".* FROM "stores" WHERE ("stores"."id" = 26) LIMIT 1
UPDATE "stores" SET "name" = 'Best Buy', "updated_at" = '2010-11-05 09:12:51.133842' WHERE ("stores"."id" = 26)
---
  def update
    @store = Store.find(params[:id])

    respond_to do |format|
      if @store.update_attributes(params[:store])

SELECT "stores".* FROM "stores" WHERE ("stores"."id" = 980190962) LIMIT 1
DELETE FROM "stores" WHERE ("stores"."id" = 980190962)
---
  def destroy
    @store = Store.find(params[:id])
    @store.destroy

SELECT "stores".* FROM "stores" WHERE (LOWER(name) = 't') LIMIT 1
---
  def search
    if params[:term]
      @stores = Store.search_by_name(params[:term])
    else
      @stores = Store.all