app/views/receipts/create.js.erb

$("#spending_total").html("<%= current_user.receipts.sum(:total) %>");
---
SELECT SUM("receipts"."total") AS sum_id FROM "receipts" WHERE ("receipts".user_id = 1)